In [1]:
import pandas as pd

# Loading CSV

In [2]:
pima_df = pd.read_csv('../data/pima.csv')    # same as pd.read_table('../data/pima.csv', delimiter = ',')
pima_df.head()

,num_preg,glucose_conc,diastolic_bp,thickness,insulin,bmi,diab_pred,age,skin,diabetes
0,6,148,72,35,0,33.6,0.627,50,1.3790,True
1,1,85,66,29,0,26.6,0.351,31,1.1426,False
2,8,183,64,0,0,23.3,0.672,32,0.0000,True
3,1,89,66,23,94,28.1,0.167,21,0.9062,False
4,0,137,40,35,168,43.1,2.288,33,1.3790,True

# Loading TSV

In [3]:
chiporders_df = pd.read_table('../data/chip-orders.tsv')
chiporders_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

# Selective Loading

### Columns

In [4]:
pd.read_csv('../data/ufo.csv', usecols = ['City', 'State']).head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

### Rows

In [5]:
pd.read_csv('http://bit.ly/ufo-reports', nrows = 5)

                   City  Colors Reported Shape Reported State             Time
0                Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke              NaN           OVAL    CO  2/15/1931 14:00
3               Abilene              NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair              NaN          LIGHT    NY  4/18/1933 19:00

# Correcting Column Names

In [6]:
ufo_df = pd.read_csv('../data/ufo.csv')
ufo_df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo_df.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [8]:
# ufo_df.columns = ['city', 'colors_reported', 'shape_reported', 'state', 'time', 'location']  # bulk rename
# ufo_df.rename(columns = {'Shape Reported': 'shape_reported'}, inplace = True) # single rename

In [9]:
ufo_df.columns = ufo_df.columns.str.lower()
ufo_df.columns = ufo_df.columns.str.replace(' ', '_')

In [10]:
ufo_df.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time'], dtype='object')

# Reading Any Damaged FIle

In [11]:
pd.read_table('../data/movie-users.csv', nrows = 5)

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [12]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

movieusers_df = pd.read_table('../data/movie-users.csv', sep = '|', header = None, names = user_cols)
movieusers_df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213